let knowledge = 
[
    ["Дисперсия", "- это", "это совокупность явлений, обусловленных зависимостью абсолютного показателя преломления вещества от частоты (или длины волны) света (частотная дисперсия), или зависимостью фазовой скорости света в веществе от частоты (или длины волны)."],
    ["Дисперсия", "зависит", "от частоты света."],
    ["Дисперсия", "существует", "только в веществе и отсутствует в вакууме."],
    ["фазоваая скорость", "- это", "скорость перемещения в пространстве волновой поверхности − поверхности, на которой колебания происходят в одной фазе."],
    ["фазовая скорость для света", "- это", "распространение в пространстве волны, воспринимаемой наблюдателем как свет одного цвета."],
    ["абсолютный показатель преломления", "- это", "я безразмерная величина, определяющая отношение фазовой скорости света в вакууме к скорости света в среде."],
    ["призматический спектр", "- это", "радужная полоска из многих цветов на экране, образованная от пучка света, прошедшего через призму"],
    ["дисперсионный спектр", "- это", "радужная полоска из многих цветов на экране, образованная от пучка света, прошедшего через призму"],
    ["нормальная дисперсия", "- это", "когда при увелечении частоты показатель преломления увеличивается (dn/dω > 0) или при увеличении длины волны показатель преломления уменьшается."],
    ["аномальная дисперсия", "- это", "когда при увеличении частоты показатель преломления уменьшается (dn/dω < 0) или при увеличении длины волны показатель преломления увеличивается (dn/dλ > 0)"],
    ["длина волны красного цвета", "равна", "0.77 мкм"],
    ["длина волны ораньжевого цвета", "равна", "0.62 мкм"],
    ["длина волны желтого цвета", "равна", "0.56 мкм"],
    ["длина волны зеленого цвета", "равна", "0.53 мкм"],
    ["длина волны голубого цвета", "равна", "0.5 мкм"],
    ["длина волны синего цвета", "равна", "0.46 мкм"],
    ["длина волны фиолетового цвета", "равна", "0.42 мкм"],
    ["спектральный анализ", "- это", "спектральный метод определения химического состава вещества"],
    ["спектральный анализ", "основан на", "характерном для каждого элемента, находящегося в состоянии газа или пара, определенного спектра излучения."],
    ["спектр поглощения", "- это", "зависимость показателя поглощения вещества от длины волны излучения."],
    ["спектр поглощения", "образуется", "черными линиями, появляющимися в спектре, соответствующими линиям излучения газа, через который был пропущен свет."],
    ["спектр поглощения", "обусловлен", "тем, что газы поглощают точно те же линии, которые они сами излучают."],
    ["монохромный свет", "- это", "свет одного цвета (одной длины волны)"],
    ["разрешающая способность", "- это", "способность оптических приборов давать раздельное изображение двух близких друг к другу точек объекта."],
    ["гониометр", "- это", "прибор для высокоточного измерения углов"],
    ["коллиматор", "- это", "устройство для получения параллельных пучков лучей света или частиц."],
    ["дифракционная решетка", "- это", "оптический прибор, действие которого основано на использовании явления дифракции света. Представляет собой совокупность большого числа регулярно расположенных штрихов, нанесённых на некоторую поверхность."],
    ["автоколлиматор", "- это", "зрительная труба, которая позволяет контролировать перпендикулярность ее оптической оси по отношению к отражающей поверхности"],
    ["автоколлиматор", "- это", "разновидность коллиматора, измерительный прибор для измерения малых углов."],
    ["окуляр гаусса", "- это", "конструкция окуляра с крестом из нитей и осветителем"],
    ["окуляр", "- это", "элемент оптической системы, обращённый к глазу наблюдателя, часть оптического прибора, предназначенная для рассматривания изображения, формируемого объективом или главным зеркалом прибора."],
    ["нониус", "- это", "вспомогательная шкала, устанавливаемая на различных измерительных приборах и инструментах, служащая для более точного определения количества долей делений основной шкалы. "],
    ["газоразрядная лампа", "- это", "источник света, излучающий энергию в видимом диапазоне."],
    ["угловая дисперсия", "равна", "угловому расстоянию между двумя спектральными линиями, длины волн которых отличаются на единицу. "],
    ["период дифракционной решетки", "- это", "расстояние между серединами соседних щелей"],
    ["оптические стекла", "- это", "оптически прозрачные вещества, используемые в технике"],
    ["оптические стекла", "бывают", "природного и искусственного происхождения. Они обладают различными показателями преломления и аразличными дисперсиями."],
    ["число Аббе", "- это", "безразмерная величина, используемая в оптике как мера дисперсии света в прозрачных средах. Чем оно меньше, тем больше дисперсия и тем сильнее хроматическая аберрация среды"],
    ["показатель преломления", "- это", "безразмерная физическая величина, характеризующая отличие фазовых скоростей света в двух средах."],
    ["дисперсионная призма", "- это", "оптическая призма, обычно имеющую форму геометрической треугольной призмы, используемую в качестве спектроскопического компонента.а"],
    ["разрешающая способность призмы", "зависит от", "ширины ее основания"]
]

let endings =
[
    ["ет","(ет|ут|ют)"], 
    ["ут","(ет|ут|ют)"], 
    ["ют","(ет|ут|ют)"],		     

    ["ит","(ит|ат|ят)"], 
    ["ат","(ит|ат|ят)"], 
    ["ят","(ит|ат|ят)"],		     

    ["ется","(ет|ут|ют)ся"], 
    ["утся","(ет|ут|ют|ующие)ся"], 
    ["ются","(ет|ут|ют)ся"], 

    ["ится","(ит|ат|ят)ся"], 
    ["атся","(ит|ат|ят)ся"], 
    ["ятся","(ит|ат|ят)ся"],     

    ["ящие","ящие"],
    ["ee", "ee"],
    ["ен","ен"],
    ["ую","ая"],
    ["му","ма"],
    ["ена","ена"], 
    ["ено","ено"], 
    ["ены","ены"],		    

    ["ан","ан"], 
    ["ая","ую"],
    ["ана","ана"], 
    ["ано","ано"], 
    ["аны","аны"],		    

    ["жен","жен"], 
    ["жна","жна"], 
    ["жно","жно"], 
    ["жны","жны"],

    ["какой","какой"],
    ["какая","какая"],
    ["где","страна"],
    ["какова","какова"],
    ["такое", "является"],
    ["такое", "- это"],
    ["такой ", "- это"],
    ["кто", "кто"],
    ["как", "чтобы"],
    ["виды", "вида"],

    ["go", "go"],
    ["го", "го"],
    ["ов", ""],
    ["цилиндры", "цилиндр"],
    ["os", "os"],
    ["ос", "ос"],
]


let blacklist =
["замена", "замены", "атрибут", "маршрут", "член", "нет"]

function getEndingIndex(word)
{
    if(blacklist.indexOf(word) !== -1)
        return -1;
    
    for(let i = 0; i < endings.length; i++)
        if(word.substring(word.length - endings[i][0].length) == endings[i][0])
            return i;

    return -1;
}

function firstSymbolToLowerCase(str)
{
    return str.substring(0, 1).toLowerCase() + str.substring(1);
}

function firstSymbolToUpperCase(str)
{
    return str.substring(0, 1).toUpperCase() + str.substring(1);
}

function getAnswer(question)
{
    let text = firstSymbolToLowerCase(question);
    let separators = "'\",.!?()[]\\/";
    for(let i = 0; i < separators.length; i++)
        text = text.replace(separators[i], " " + separators[i]);

    let words = text.split(' ');

    for(let i = 0; i < words.length; i++)
        words[i] = firstSymbolToLowerCase(words[i]);

    let result = false;
    let answer = "";

    for(let i = 0; i < words.length; i++)
    {
        let ending = getEndingIndex(words[i]);

        if(ending >= 0)
        {
            words[i] = words[i].substring(0, words[i].length - endings[ending][0].length) + endings[ending][1]

            console.log(words)

            let predicate = new RegExp(".*" + words[i] + ".*");

            if(endings[ending][0] == endings[ending][1])
            {
                if(words[i] != "нужен")
                {
                    predicate = new RegExp(".*" + words[i] + " " + words[i + 1] + ".*");
                    i++;
                }
            }
            console.log(predicate)  

            let subjectReg = words.slice(i + 1).join(".*");
            console.log(subjectReg)

            if(subjectReg.length > 3)
            {
                let subject = new RegExp(".*" + subjectReg + ".*");
                console.log(subject)

                for(let j = 0; j < knowledge.length; j++)
                {
                    if(predicate.test(knowledge[j][1].toLowerCase()) && (subject.test(knowledge[j][0].toLowerCase()) || subject.test(knowledge[j][2].toLowerCase())))
                    {
                        answer += firstSymbolToUpperCase(knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2]);
                        result = true;
                    }
                }

                if(!result)
                {
                    for(let j = 0; j < knowledge.length; j++)
                    {
                        if(subject.test(knowledge[j][0].toLowerCase() || subject.test(knowledge[j][2].toLowerCase())))
                        {
                            answer += firstSymbolToUpperCase(knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2]);
                            result = true;
                        }
                    }
                }
            }
        }
    }

    if(!result)
        answer = "Ответ не найден.";

    return answer;
}

$(document).ready (function() {
    $("#dialog-window").hide();
    $("#dialog-toggle").click(function(){
        $("#dialog-window").toggle();
    });
    $("#get-answer-button").click(function(){
        document.getElementById("answer-box").textContent = getAnswer(document.getElementById('questionField').value);
    });
}
);
