let knowledge = 
[
    ["Угловая дисперсия", "равна", "угловому расстоянию между двумя спектральными линиями, длины волн которых отличаются на единицу. "],
    ["Дисперсия", "- это", "совокупность явлений, обусловленных зависимостью абсолютного показателя преломления вещества от частоты (или длины волны) света (частотная дисперсия), или зависимостью фазовой скорости света в веществе от частоты (или длины волны)."],
    ["Дисперсия", "зависит", "от частоты света."],
    ["Дисперсия", "существует", "только в веществе и отсутствует в вакууме."],
    ["фазовая скорость", "- это", "скорость перемещения в пространстве волновой поверхности − поверхности, на которой колебания происходят в одной фазе."],
    ["фазовая скорость для света", "- это", "распространение в пространстве волны, воспринимаемой наблюдателем как свет одного цвета."],
    ["абсолютный показатель преломления", "- это", "безразмерная величина, определяющая отношение фазовой скорости света в вакууме к скорости света в среде."],
    ["призматический спектр", "- это", "радужная полоска из многих цветов на экране, образованная от пучка света, прошедшего через призму"],
    ["дисперсионный спектр", "- это", "радужная полоска из многих цветов на экране, образованная от пучка света, прошедшего через призму"],
    ["нормальная дисперсия", "- это", "когда при увелечении частоты показатель преломления увеличивается (dn/dω > 0) или при увеличении длины волны показатель преломления уменьшается."],
    ["аномальная дисперсия", "- это", "когда при увеличении частоты показатель преломления уменьшается (dn/dω < 0) или при увеличении длины волны показатель преломления увеличивается (dn/dλ > 0)"],
    ["длина волны красного цвета", "равна", "0.77 мкм"],
    ["длина волны ораньжевого цвета", "равна", "0.62 мкм"],
    ["длина волны желтого цвета", "равна", "0.56 мкм"],
    ["длина волны зеленого цвета", "равна", "0.53 мкм"],
    ["длина волны голубого цвета", "равна", "0.5 мкм"],
    ["длина волны синего цвета", "равна", "0.46 мкм"],
    ["длина волны фиолетового цвета", "равна", "0.42 мкм"],
    ["спектральный анализ", "- это", "спектральный метод определения химического состава вещества"],
    ["спектральный анализ", "основан", "на характерном для каждого элемента, находящегося в состоянии газа или пара, определенного спектра излучения."],
    ["спектр поглощения", "- это", "зависимость показателя поглощения вещества от длины волны излучения."],
    ["спектр поглощения", "образуется", "черными линиями, появляющимися в спектре, соответствующими линиям излучения газа, через который был пропущен свет."],
    ["спектр поглощения", "обусловлен", "тем, что газы поглощают точно те же линии, которые они сами излучают."],
    ["монохромный свет", "- это", "свет одного цвета (одной длины волны)"],
    ["разрешающая способность", "- это", "способность оптических приборов давать раздельное изображение двух близких друг к другу точек объекта."],
    ["гониометр", "- это", "прибор для высокоточного измерения углов"],
    ["коллиматор", "- это", "устройство для получения параллельных пучков лучей света или частиц."],
    ["дифракционная решетка", "- это", "оптический прибор, действие которого основано на использовании явления дифракции света. Представляет собой совокупность большого числа регулярно расположенных штрихов, нанесённых на некоторую поверхность."],
    ["автоколлиматор", "- это", "зрительная труба, которая позволяет контролировать перпендикулярность ее оптической оси по отношению к отражающей поверхности"],
    ["автоколлиматор", "- это", "разновидность коллиматора, измерительный прибор для измерения малых углов."],
    ["окуляр гаусса", "- это", "конструкция окуляра с крестом из нитей и осветителем"],
    ["окуляр", "- это", "элемент оптической системы, обращённый к глазу наблюдателя, часть оптического прибора, предназначенная для рассматривания изображения, формируемого объективом или главным зеркалом прибора."],
    ["нониус", "- это", "вспомогательная шкала, устанавливаемая на различных измерительных приборах и инструментах, служащая для более точного определения количества долей делений основной шкалы. "],
    ["газоразрядная лампа", "- это", "источник света, излучающий энергию в видимом диапазоне."],
    ["период дифракционной решетки", "- это", "расстояние между серединами соседних щелей"],
    ["оптические стекла", "- это", "оптически прозрачные вещества, используемые в технике"],
    ["оптические стекла", "бывают", "природного и искусственного происхождения. Они обладают различными показателями преломления и аразличными дисперсиями."],
    ["число Аббе", "- это", "безразмерная величина, используемая в оптике как мера дисперсии света в прозрачных средах. Чем оно меньше, тем больше дисперсия и тем сильнее хроматическая аберрация среды"],
    ["показатель преломления", "- это", "безразмерная физическая величина, характеризующая отличие фазовых скоростей света в двух средах."],
    ["дисперсионная призма", "- это", "оптическая призма, обычно имеющую форму геометрической треугольной призмы, используемую в качестве спектроскопического компонента.а"],
    ["разрешающая способность призмы", "зависит от", "ширины ее основания"],
    ["частота", "- это", "количество волн, которые распространяются в пространстве в любой промежуток времени"],
    ["диапазон частот видимого света", "составляет", "от 430 триллионов герц (красный цвет), до 750 триллионов герц (фиолетовый цвет)."],
    ["диэлектрическая проницаемость", "- это", "коэффициент, входящий в математическую запись закона Кулона для силы взаимодействия точечных зарядов q1 и q2, находящихся в однородной изолирующей среде на расстоянии r12 друг от друга"],
    ["интерференция волн", "- это", "взаимное увеличение или уменьшение результирующей амплитуды двух или нескольких когерентных волн при их наложении друг на друга. Сопровождается чередованием максимумов и минимумов интенсивности в пространстве."],
    ["поляризованность", "- это", "векторная физическая величина, равная дипольному моменту единицы объёма вещества, возникающему при его поляризации, количественная характеристика диэлектрической поляризации."],
    ["радуга", "- это", "атмосферное, оптическое и метеорологическое явление, наблюдаемое при освещении ярким источником света (в природе солнцем или луной — см. лунная радуга) множества водяных капель (дождя или тумана)."],
    ["показатель преломления", "имеет вид", "<img width='100' height='50' src='../img/item_dispersion.png'/>"],
    ["тепловое движение", "- это", "процесс хаотичного движения частиц, образующих вещество. Чем выше температура, тем больше скорость движения частиц. "],
    ["фотосфера", "- это", "нижний слой звёздной атмосферы, в котором формируется непрерывный свет видимого спектра."],
    ["электромагнитная волна","разлагается","на две поляризационные составляющие (вертикальную и горизонтальную"],
    ["излучение антенн","имеет","линейную поляризацию"],
    ["Опыт Ньютона","заключается","в разложении белого света с помощью призмы."],
    ["дисперсионный спектр","выглядит","<img width='100' height='50' class='theory-img gallery_pics' src='../img/Dispersion-Graphic.png'/>"],
    ["Радуга","выглядит","<img width='100' height='50' class='theory-img gallery_pics' src='../img/Rainbow.jpg'/>"],
    ["Коллиматор", "имеет вид", "<img width='100' height='50' class='theory-img gallery_pics' src='../img/Коллиматор.png'/>"],
    ["Линейка","выглядит","<img width='100' height='50' class='theory-img gallery_pics' src='../img/PurpleRuler.jpg'/>"],
    ["Источник света","выглядит","<img width='50' height='100' src='../img/Источник света.png'/>"],
    ["Зрительная труба","выглядит","<img width='100' height='50' src='../img/Зрительная труба.png'/>"],
    ["Неподвижный кронштейн","выглядит","<img width='100' height='50' src='../img/Неподвижный кронштейн.png'/>"],
    ["Поворотный кронштейн","выглядит","<img width='100' height='50' src='../img/Поворотный кронштейн.png'/>"],
    ["Поворотный столик","выглядит","<img width='100' height='50' src='../img/Поворотный столик.png'/>"],
    ["Фазовая скорость волны","имеет вид","<img width='100' height='50' src='../img/Speed.jpg'/>"],
    ["Гониометр","имеет вид","<img width='100' height='50' src='../img/goniometr.jpg'/>"],
    ["Гониометр"," - это","класс измерительных приборов для высокоточного измерения углов."],
    ["Гониометр","предназначен","для измерения углов между плоскими полированными гранями твердых прозрачных и непрозрачных деталей, измерения показателя преломления прозрачных твердых материалов, измерения дисперсии и угла наименьшего отклонения призм, измерения пирамидальности призм."],
    ["Цена деления шкалы лимба","равна","1 градусу"],
    ["Цена деления шкалы микрометра","равна","1 секунде"],
    ["Ньютон","родился","в Англии 25 декабря 1642 года. <img width='50' height='100' src='../img/Newton.jpg'/>"],
    ["Ньютон","разработал","теорию цвета"],
    ["Ньютон","построил","первый зеркальный телескоп"],
    ["Ньютон","создал","теорию интерференционных колец (кольца Ньютона)"],
    ["Свет","имеет","корпускулярную и волновую составляющую."],
    ["Максвелл","родился","в Шотландии 13 июня 1831 года. <img width='50' height='100' src='../img/Maxwell.jpg'/>"],
    ["Максвелл","доказал","электромагнитную природу света."],
    ["Максвелл","доказал","существование давления света."],
    ["Давление света"," - это","давление, которое оказывает световое излучение, падающее на поверхность тела."],
    ["Радуга","является","примером дисперсии света в природе."],
    ["Лоренц","родился","18 июля 1853 года в Нидерландах."],
    ["Лоренц","доказал","электронную теорию, которая рассматривала дисперсию как взаимодействие электромагнитных волн с заряженными частицами, входящими в состав вещества и совершающими вынужденные колебания в переменном электромагнитном поле волны."],
    ["Скорость света","равна","с = 3 · 10^8 м/с"],
    ["Призма","состоит","из 5 и более граней и является полупрозрачной."],
    ["Диэлектрическая пронициаемость","показывает",", во сколько раз сила взаимодействия двух электрических зарядов в среде меньше, чем в вакууме."],
    ["Квазиупругая сила"," - это","переменная сила F, действующая на материальную точку М, пропорциональная и противоположная по направлению смещению г точки из положения равновесия О"],
    ["Движение частиц","обусловлено","высокой температурой"],
    ["Спектральный анализ","основан","на хаотическом тепловом движении частиц"],
    ["Спектр","является","непрерывным (состоит более чем из 7 цветов)"],
    ["Область аномальной дисперсии","совпадает","с полосой поглащения"],
    ["Спектральный анализ","разделяется","на атомный и молекулярный."],
    ["Спектральный анализ","изобретен","Густавом Кирхгофом и Робертом Бунзеном"],
    ["Бунзен","изобрел","горелку Бунзена (устройство, имеющее инжектор, установленный в металлической трубке с отверстиями для поступления в трубку атмосферного воздуха, которая закреплена на подставке с боковым вводом для подачи в трубку газа)"],
    ["Оптический спектр"," - это","распределение оптического излучения по длинам волн."],
    ["Луч красного цвета","отклоняется","на меньший угол"],
    ["Луч фиолетового цвета","отклоняется","на больший угол"],
    ["Окрашенность тел","определяется","зависимостью \"поглощающей\" способности тела от длины волны падающего света."],
    ["Светофильтр","используется","для выделения части спектра электромагнитного излучения."],
    ["Светофильтр","применяется","для корректировки света"],
    ["Защитный фильтр","предназначен","для предохранения объектива от внешнего воздействия."],
    ["Цветовой диск Ньютона","выглядит"," <img width='100' height='100' src='../img/Disk.jpg'/>"],
    ["Белый цвет","состоит","из множества цветов"],
    ["озвученная карта", "выглядит", "<iframe width='560' height='315' style='transform: scale(0.5); margin-left: -135px;' src='../ButtonsScaled_HTML5 Canvas.html'></iframe>"],
    ["принцип работы установки", "представлен", "ниже   </br><video style='transform: scale(1);' src='../videos/Goniometr.mp4' controls></video>"]
]

let endings =
[
    ["ет","(ет|ут|ют)"], 
    ["ут","(ет|ут|ют)"], 
    ["ют","(ет|ут|ют)"],		     

    ["ит","(ит|ат|ят)"], 
    ["ат","(ит|ат|ят)"], 
    ["ят","(ит|ат|ят)"],		     

    ["ется","(ет|ут|ют)ся"], 
    ["утся","(ет|ут|ют|ующие)ся"], 
    ["ются","(ет|ут|ют)ся"], 

    ["ится","(ит|ат|ят)ся"], 
    ["атся","(ит|ат|ят)ся"], 
    ["ятся","(ит|ат|ят)ся"],     

    ["ящие","ящие"],
    ["ee", "ee"],
    ["ен","ен"],
    ["ую","ая"],
    ["му","ма"],
    ["ена","ена"], 
    ["ено","ено"], 
    ["ены","ены"],		    

    ["ан","ан"], 
    ["ая","ую"],
    ["ана","ана"], 
    ["ано","ано"], 
    ["аны","аны"],		    

    ["жен","жен"], 
    ["жна","жна"], 
    ["жно","жно"], 
    ["жны","жны"],

    ["какой","какой"],
    ["какая","какая"],
    ["где","страна"],
    ["какова","какова"],
    ["такое", "является"],
    ["такое", "- это"],
    ["такой ", "- это"],
    ["кто", "кто"],
    ["как", "чтобы"],
    ["виды", "вида"],
    ["основан", "основан"],
    ["равна", "равна"],

    ["ов", ""],
]


let blacklist =
["замена", "замены", "атрибут", "маршрут", "член", "нет"]

function imgConstructor(path)
{
    return '<img src="'+ path + '"></img>"';
}

function getEndingIndex(word)
{
    if(blacklist.indexOf(word) !== -1)
        return -1;
    
    for(let i = 0; i < endings.length; i++)
        if(word.substring(word.length - endings[i][0].length) == endings[i][0])
            return i;

    return -1;
}

function firstSymbolToLowerCase(str)
{
    return str.substring(0, 1).toLowerCase() + str.substring(1);
}

function firstSymbolToUpperCase(str)
{
    return str.substring(0, 1).toUpperCase() + str.substring(1);
}

function getAnswer(question)
{
    let text = firstSymbolToLowerCase(question);
    let separators = "'\",.!?()[]\\/";
    for(let i = 0; i < separators.length; i++)
        text = text.replace(separators[i], " " + separators[i]);

    let words = text.split(' ');

    for(let i = 0; i < words.length; i++)
        words[i] = firstSymbolToLowerCase(words[i]);

    let result = false;
    let answer = "";

    for(let i = 0; i < words.length; i++)
    {
        let ending = getEndingIndex(words[i]);

        if(ending >= 0)
        {
            words[i] = words[i].substring(0, words[i].length - endings[ending][0].length) + endings[ending][1]

            console.log(words)

            let predicate = new RegExp(".*" + words[i] + ".*");

            if(endings[ending][0] == endings[ending][1])
            {
                if(words[i] != "нужен")
                {
                    predicate = new RegExp(".*" + words[i] + " " + words[i + 1] + ".*");
                    i++;
                }
            }
            console.log(predicate)  

            let subjectReg = words.slice(i + 1).join(".*");
            console.log(subjectReg)

            if(subjectReg.length > 3)
            {
                let subject = new RegExp(".*" + subjectReg + ".*");
                console.log(subject)

                for(let j = 0; j < knowledge.length; j++)
                {
                    if(predicate.test(knowledge[j][1].toLowerCase()) && (subject.test(knowledge[j][0].toLowerCase()) || subject.test(knowledge[j][2].toLowerCase())))
                    {
                        answer += firstSymbolToUpperCase(knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2]);
                        result = true;
                        break;
                    }
                }

                if(!result)
                {
                    for(let j = 0; j < knowledge.length; j++)
                    {
                        if(subject.test(knowledge[j][0].toLowerCase() || subject.test(knowledge[j][2].toLowerCase())))
                        {
                            answer += firstSymbolToUpperCase(knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2]);
                            result = true;
                            break;
                        }
                    }
                }
            }
        }
    }

    if(!result)
        answer = "Ответ не найден.";

    return answer;
}

$(document).ready (function() {
    $("#dialog-window").hide();
    $("#dialog-toggle").click(function(){
        $("#dialog-window").toggle();
    });

    $("#get-answer-button").click(function(){
        var answer = getAnswer(document.getElementById('questionField').value);
        var audio = "<audio style='width: 200px; height: 20px;' controls='true' autoplay='false' src='http://tts.voicetech.yandex.net/generate?format=wav&lang=ru-RU&key=4a4d3a13-d206-45fc-b8fb-e5a562c9f587&text="+answer+"'></audio>";
        
        document.getElementById("answer-box").innerHTML = answer + '</br>' + audio; 
    });

    /*window.ya.speechkit.settings = {apikey: '5c6d6536-b453-4589-9bc7-f16c7a795106'}
        new ya.speechkit.Textline('questionField', {
        onInputFinished: function(text) {        
            document.getElementById('questionField').value=text;
        }
    });*/
}
);
